{
  "backend/main.mo": "Main backend actor implementing user profiles, exercises, doubts, videos, topics, and notes with CRUD operations, access control via MixinAuthorization, and blob storage via MixinStorage.",
  "backend/migration.mo": "Migration module defining old and new actor state types and a run function that initializes new collections (userProfiles, exercises, doubts, videos) while preserving existing topics, notes, and nextNoteId.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including TTS for AI teacher, doubt clarification system, ready-made notes, and Google OAuth authentication with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and utilities covering routing, authentication, notes, doubts, teacher avatar, voice control, and camera integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag, app title 'Concept Notes Tutor', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, Doubts, Quiz, Daily Practice, Ready Notes, Notes, and Settings, wrapped in ThemeProvider, LanguageProvider, and ProfileSetupModal.",
  "frontend/src/components/auth/AuthButtons.tsx": "Authentication component with sign in/out button using Internet Identity, handling login states, clearing query cache on logout, and displaying toast notifications.",
  "frontend/src/components/common/OfflineIndicator.tsx": "Alert component displaying a warning banner with WifiOff icon when the app detects offline status via useOfflineStorage hook.",
  "frontend/src/components/doubts/DoubtDetailView.tsx": "Displays detailed view of a single doubt entry with question, attached image, solution/explanation, and status badge. Includes a back button to return to the list.",
  "frontend/src/components/doubts/DoubtHistoryList.tsx": "Shows a searchable list of submitted doubts with status badges and timestamps. Clicking a doubt item triggers a callback to view its details.",
  "frontend/src/components/doubts/DoubtSubmissionForm.tsx": "Form for submitting new doubts with text input, camera capture for images, and voice-to-text support. Handles image preview, camera controls, and submission to backend.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper that includes the app navigation bar, offline indicator, and renders children in a flex container with bottom padding for mobile nav.",
  "frontend/src/components/learning/TopicPointsList.tsx": "Displays a list of topic points with selection state and checkmarks. Includes a button to create a note for the current topic.",
  "frontend/src/components/learning/VideoPlayer.tsx": "Video player component with play/pause state management and error handling. Uses native HTML5 video element with controls.",
  "frontend/src/components/media/EduIcon.tsx": "Simple component that renders educational emoji icons (book, pencil, microscope, etc.) based on a string prop.",
  "frontend/src/components/navigation/AppNav.tsx": "Bottom navigation bar (fixed on mobile, static on desktop) with scrollable buttons for Dashboard, Doubts, Notes, Quiz, Practice, My Notes, and Settings. Highlights active route.",
  "frontend/src/components/notes/CameraCaptureDialog.tsx": "Modal dialog for capturing photos using the device camera. Manages camera lifecycle, displays video preview, and returns captured image file on success.",
  "frontend/src/components/notes/NoteEditor.tsx": "Note creation and editing form with title, content textarea, camera capture integration, and save/delete actions. Handles image attachment to existing notes.",
  "frontend/src/components/notes/NoteImagePreview.tsx": "Displays an attached image from an ExternalBlob in a card with a border and label.",
  "frontend/src/components/notes/NotesList.tsx": "Renders a list of note cards with title, content preview, and badges for topic/image attachments; highlights the selected note.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for first-time profile setup that collects user name, class level, and subject preferences; shows automatically when authenticated user has no profile.",
  "frontend/src/components/settings/LanguageSelector.tsx": "Dropdown selector for choosing teaching language (English, Hindi, Marathi) stored in global language state.",
  "frontend/src/components/settings/ProfileSettings.tsx": "Card component for editing user profile including name, class level, and subject preferences; saves updates to backend.",
  "frontend/src/components/settings/VoiceControlSettings.tsx": "Toggle switch for enabling voice control with browser compatibility check; displays supported voice commands (play, pause, next, previous, teacher, notes).",
  "frontend/src/components/teacher/simpleTeacherExplanations.ts": "Provides hardcoded teacher explanations in English, Hindi, and Marathi for common learning sections (Introduction, Key Concepts, Examples, Practice Problems, Summary).",
  "frontend/src/components/teacher/TeacherAvatarPanel.tsx": "Collapsible panel showing AI teacher avatar with text-to-speech explanation of the selected learning point; includes play/pause/stop controls.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication; invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOfflineStorage.ts": "Custom hook that monitors online/offline status and provides localStorage-based caching functions (save, get, clear) with timestamp tracking for offline data persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including notes CRUD, topics, user profiles, doubts, exercises, and leaderboard data with automatic cache invalidation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech Recognition API to provide voice-to-text transcription with configurable language, continuous mode, and interim results support.",
  "frontend/src/hooks/useTextToSpeech.ts": "Custom hook wrapping the Web Speech Synthesis API to provide text-to-speech functionality with configurable voice parameters (rate, pitch, volume) and playback controls.",
  "frontend/src/hooks/useVoiceControl.ts": "Implements voice command navigation and learning view controls using speech recognition, with localStorage-based enable/disable toggle and support for commands like 'play', 'next', 'notes'.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm coral and teal color theme for both light and dark modes, plus base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component into the DOM.",
  "frontend/src/pages/DailyPracticePage.tsx": "Page component showing a 'coming soon' placeholder for daily practice questions feature, with authentication gate requiring Internet Identity login.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page that displays a welcome screen for unauthenticated users and a grid of navigation cards (Ask Doubts, Study Notes, Quiz, Daily Practice, My Notes, Progress) for authenticated users.",
  "frontend/src/pages/DoubtsPage.tsx": "Page for submitting and viewing doubts with tabs for submission form and history list; shows sign-in prompt for unauthenticated users and detail view when a doubt is selected.",
  "frontend/src/pages/NotesPage.tsx": "Personal notes management page with a two-column layout: notes list on the left and editor on the right, allowing users to create, view, and edit their notes.",
  "frontend/src/pages/QuizPage.tsx": "Placeholder page for quiz functionality showing a 'Coming Soon' card with planned features like taking quizzes, instant feedback, and progress tracking.",
  "frontend/src/pages/ReadyNotesPage.tsx": "Placeholder page for ready-made study notes showing a 'Coming Soon' card with planned features like browsing by class/subject, highlighting, and downloading.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page containing sections for authentication, profile settings, language selection, voice control settings, and app footer with attribution.",
  "frontend/src/pages/TopicBrowserPage.tsx": "Topic browsing page with a banner, search bar, and grid of topic cards that navigate to individual topic detail pages for video learning with AI teacher guidance.",
  "frontend/src/pages/TopicLearningPage.tsx": "Main topic learning page component that displays a topic header, video placeholder, topic points list, and teacher avatar panel with voice control integration for navigation.",
  "frontend/src/state/language.tsx": "React context provider for managing app language state (English, Hindi, Marathi) with localStorage persistence.",
  "frontend/src/utils/fileToExternalBlob.ts": "Utility function that converts a File object to an ExternalBlob by reading its ArrayBuffer and converting to Uint8Array.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors using OKLCH color space, container settings, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project metadata describing an educational app (Class 4-12) with AI teacher avatar, doubt resolution via text/voice/camera, smart notes, Google auth, progress tracking, and multilingual support; includes architectural notes and existing feature list."
}